package com.example.cms.system.constant;

import lombok.NoArgsConstructor;

import static lombok.AccessLevel.PRIVATE;

/**
 * 정규식
 */
@NoArgsConstructor(access = PRIVATE)
public class RegexConst {

    // ================================================================================================================
    // 비밀번호 정규식
    // ================================================================================================================
    /**
     * 비밀번호 정규식
     * <p>
     * - 영문, 특수문자, 숫자 포함 11자 이상 <br>
     * - 비밀번호는 영문과 특수문자 숫자를 포함하며 11자 이상이어야 한다.
     * </p>
     */
    public static final String PWD_REGEX = "^(?=.*[a-zA-Z])(?=.*\\d)(?=.*\\W).{11,30}$";

    // ================================================================================================================
    //
    // ================================================================================================================

}
